import sys

input = sys.stdin.readline

N, M = map(int, input().rstrip().split())
arr = []
for i in range(N):
    arr.append(list(map(int, input().rstrip().split())))

blocks = [[(0, 0), (0, 1), (0, 2), (0, 3)], # ㅡ
        [(0, 0), (1, 0), (2, 0), (3, 0)], # ㅣ
        [(0, 0), (0, 1), (1, 0), (1, 1)], # ㅁ
        [(0, 0), (1, 0), (2, 0), (2, 1)], # L-0
        [(2, 0), (2, 1), (1, 1), (0, 1)], # L-0 mirror
        [(0, 0), (1, 0), (0, 1), (0, 2)], # L-90
        [(0, 0), (1, 0), (1, 1), (1, 2)], # L-90 mirror
        [(0, 0), (0, 1), (1, 1), (2, 1)], # L-180
        [(0, 0), (1, 0), (2, 0), (0, 1)], # L-180 mirror
        [(1, 0), (1, 1), (1, 2), (0, 2)], # L-270
        [(0, 0), (0, 1), (0, 2), (1, 2)], # L-270 mirror
        [(0, 0), (1, 0), (1, 1), (2, 1)], # 계단모양-1
        [(0, 1), (1, 0), (1, 1), (2, 0)], # 계단모양-1 mirror
        [(1, 0), (0, 1), (1, 1), (0, 2)], # 계단모양-2
        [(0, 0), (0, 1), (1, 1), (1, 2)], # 계단모양-2 mirror
        [(1, 0), (1, 1), (1, 2), (0, 1)], # ⫠
        [(0, 0), (1, 0), (2, 0), (1, 1)], # ⊦
        [(0, 0), (0, 1), (0, 2), (1, 1)], # ⫟
        [(1, 0), (0, 1), (1, 1), (2, 1)] # ⫞
        ]

answer = 0
for i in range(N):
    for j in range(M):
        for block in blocks:
            s = 0
            for x, y in block:
                if i+x < N and j+y < M:
                    s += arr[i+x][j+y]
                else:
                    s = 0
                    break
            if answer < s:
                answer = s
print(answer)